Revit 2024 API
BrowserOrganization.GetCurrentBrowserOrganizationForViews Method
 Gets the BrowserOrganization that applies to the Views section of the project browser.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static BrowserOrganization GetCurrentBrowserOrganizationForViews(
	Document document
)
Visual Basic
Public Shared Function GetCurrentBrowserOrganizationForViews ( _
	document As Document _
) As BrowserOrganization
Visual C++
public:
static BrowserOrganization^ GetCurrentBrowserOrganizationForViews(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 Revit document from which to get the organization data.
Return Value
 The BrowserOrganization for views, or null if no view sections exist
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
BrowserOrganization Class
Autodesk.Revit.DB Namespace